main_menu = ["Главное меню",
            "Открыть телефонную книгу",
            "Сохранить телефонную книгу",
            "Показать контакты",
            "Создать контакт",
            "Найти контакт",
            "Изменить контакт",
            "Удалить контакт",
            "Выход"]

choice_main_menu = f"Выберите пункт меню ({1}-{len(main_menu)-1}):"
choice_main_menu_error = f"Нужно ввести число от 1 до {len(main_menu)-1}!:"

phone_book_opened_successful = "Телефонная книга открыта успешно!"
phone_book_saved_successful = "Телефонная книга сохранена успешно!"

empty_phone_book_error = "Телефонная книга пуста или не  открыта!"

